[
  {
    "title": "Frontend Developer & Frontend Lead ― Profile Software Services, Madrid",
    "description": "Trabajo actualmente como Frontend Developer & Frontend Lead para el cliente de Mutua Madrileña aplicando mis conocimientos para la implementación de soluciones tecnológicas de Front, instruir a mis compañeros, analizar las mejores tecnologías para aplicar en nuestro día a día, mantener & mejorar la estabilidad de los proyectos en los que me encuentro trabajando (7 proyectos) y agregar nuevas funcionalidades en estos proyectos.\n\nTambién he tenido el papel de llevar a cabo la arquitectura de diversos proyectos y realizar las migraciones & actualizaciones de las tecnologías necesarias (Angular, Capacitor, Cordova, Ionic, jQuery)",
    "skills": [
      "Angular",
      "Angular Standalone",
      "RxJs",
      "NgRx (Redux)",
      "TypeScript",
      "JavaScript",
      "Git",
      "Jasmine/Karma",
      "API REST",
      "Ionic",
      "Capacitor",
      "Cordova",
      "Stencil.js",
      "JSON",
      "HTML/CSS/SCSS",
      "jQuery",
      "React",
      "Keycloak",
      "Web Components",
      "Jira/Confluence",
      "SCRUM",
      "MySQL",
      "Jenkins",
      "Android",
      "Ionic Trapeze",
      "SOLID",
      "iOS/Swift"
    ],
    "date": "DICIEMBRE 2022, PRESENT"
  },
  {
    "title": "Frontend Developer ― NORU, Quito",
    "description": "Me especialicé en el desarrollo y mantenimiento de funcionalidades esenciales para las aplicaciones de escritorio y móviles híbridas en NORU. Tuve un papel fundamental en la dirección de la arquitectura Frontend de las plataformas que desarrollamos, asegurando su robustez y escalabilidad.\n\nParticipé en la construcción tanto de la plataforma de presentación como de la plataforma interna de la empresa y sus web components. Esta última plataforma permitía a profesores y alumnos acceder a su propio portal para realizar actividades y evaluaciones relacionadas con las asignaturas asignadas.",
    "skills": [
      "React",
      "Jest",
      "Styled Components",
      "Angular",
      "Angular Material",
      "PrimeNG",
      "RxJs",
      "NgRx (Redux)",
      "TypeScript",
      "JavaScript",
      "Design Patterns",
      "Git",
      "Jasmine/Karma",
      "Web Components",
      "Ionic",
      "API REST",
      "Cordova",
      "MySQL",
      "HTML/CSS/SCSS",
      "e2e & Cypress",
      "SCRUM"
    ],
    "date": "AGOSTO 2019, SEPTIEMBRE 2022"
  },
  {
    "title": "Instructor de Desarrollo de Software Jr ― Genius Plus, Quito",
    "description": "Enseñé como profesor de desarrollo web Jr a principiantes, proporcionando una introducción completa de los fundamentos del desarrollo web y guiando a los estudiantes desde sus primeros pasos en esta área hasta conocer algún framework o tener los dominios básicos de una tecnología como React o Node.js con Express.js.",
    "skills": [
      "HTML/CSS/SCSS",
      "JavaScript",
      "jQuery",
      "Angular",
      "Bootstrap",
      "React",
      "React Hooks",
      "Node.js",
      "Express.js",
      "API REST",
      "JSON"
    ],
    "date": "FEBRERO 2019, JULIO 2019"
  },
  {
    "title": "Full Stack Developer ― Freelance & Personal Projects",
    "description": "Aunque esto no es una experiencia en una empresa, me encantaría destacar que soy una persona apasionada por la informática y siempre me encuentro estudiando y realizando proyectos personales o para algún cliente privado que lo necesite, esto para mantenerme al día con las tecnologías modernas y siempre estar en constante movimiento.\n\nHe realizado alrededor de 50 proyectos a lo largo de los años, con un stack usual de Angular, React e Ionic (Capacitor o Cordova), y esto sin duda me ha hecho mejor desarrollador con el pasar del tiempo.",
    "skills": [
      "Angular",
      "Angular Standalone",
      "RxJs",
      "NgRx (Redux)",
      "Open AI (Inteligencia artificial) GPT 3+, DALL-E",
      "TypeScript",
      "JavaScript",
      "Git",
      "Jasmine/Karma",
      "Bootstrap",
      "Design Patterns",
      "API REST",
      "Ionic",
      "Capacitor",
      "Cordova",
      "Stencil.js",
      "JSON",
      "HTML/CSS/SCSS",
      "jQuery",
      "React",
      "Keycloak",
      "Web Components",
      "Jira/Confluence",
      "SCRUM",
      "MySQL",
      "Jenkins",
      "Android",
      "Ionic Trapeze",
      "iOS/Swift"
    ],
    "date": "ENERO 2016, PRESENT"
  }
]
