[
  {
    "title": "Frontend Developer & Frontend Lead ― Profile Software Services, Madrid",
    "description": "I am currently working as a Frontend Developer & Frontend Lead for Mutua Madrileña client, applying my knowledge in the implementation of front-end technological solutions, instructing my colleagues, analyzing the best technologies to apply in our day-to-day, maintaining & improving the stability of the projects I am working on (7 projects) and adding new features to these projects.\n\nI have also had the role of carrying out the architecture of various projects and performing the migrations & updates of necessary technologies (Angular, Capacitor, Cordova, Ionic, jQuery).",
    "skills": [
      "Angular",
      "Angular Standalone",
      "RxJs",
      "NgRx (Redux)",
      "TypeScript",
      "JavaScript",
      "Git",
      "Jasmine/Karma",
      "REST API",
      "Ionic",
      "Capacitor",
      "Cordova",
      "Stencil.js",
      "JSON",
      "HTML/CSS/SCSS",
      "jQuery",
      "React",
      "Keycloak",
      "Web Components",
      "Jira/Confluence",
      "SCRUM",
      "MySQL",
      "Jenkins",
      "Android",
      "Ionic Trapeze",
      "SOLID",
      "iOS/Swift"
    ],
    "date": "DECEMBER 2022, PRESENT"
  },
  {
    "title": "Frontend Developer ― NORU, Quito",
    "description": "I specialized in the development and maintenance of essential functionalities for desktop and mobile hybrid applications at NORU. I played a key role in directing the frontend architecture of the platforms we developed, ensuring their robustness and scalability.\n\nI participated in the construction of both the presentation platform and the company's internal platform and its web components. This latter platform allowed teachers and students to access their own portal to perform activities and assessments related to the assigned subjects.",
    "skills": [
      "React",
      "Jest",
      "Styled Components",
      "Angular",
      "Angular Material",
      "PrimeNG",
      "RxJs",
      "NgRx (Redux)",
      "TypeScript",
      "JavaScript",
      "Design Patterns",
      "Git",
      "Jasmine/Karma",
      "Web Components",
      "Ionic",
      "REST API",
      "Cordova",
      "MySQL",
      "HTML/CSS/SCSS",
      "e2e & Cypress",
      "SCRUM"
    ],
    "date": "AUGUST 2019, SEPTEMBER 2022"
  },
  {
    "title": "Jr Software Development Instructor ― Genius Plus, Quito",
    "description": "I taught as a Jr web development instructor to beginners, providing a complete introduction to the fundamentals of web development and guiding students from their first steps in this area to knowing some framework or having the basic domains of a technology like React or Node.js with Express.js.",
    "skills": [
      "HTML/CSS/SCSS",
      "JavaScript",
      "jQuery",
      "Angular",
      "Bootstrap",
      "React",
      "React Hooks",
      "Node.js",
      "Express.js",
      "REST API",
      "JSON"
    ],
    "date": "FEBRUARY 2019, JULY 2019"
  },
  {
    "title": "Full Stack Developer ― Freelance & Personal Projects",
    "description": "Although this is not an experience in a company, I would love to highlight that I am a person passionate about computing and I am always studying and carrying out personal projects or for any private client who needs it, this to keep up to date with modern technologies and always be in constant movement.\n\nI have carried out around 50 projects over the years, with a usual stack of Angular, React, and Ionic (Capacitor or Cordova), and this undoubtedly has made me a better developer over time.",
    "skills": [
      "Angular",
      "Angular Standalone",
      "RxJs",
      "NgRx (Redux)",
      "Open AI (Artificial Intelligence) GPT 3+, DALL-E",
      "TypeScript",
      "JavaScript",
      "Git",
      "Jasmine/Karma",
      "Bootstrap",
      "Design Patterns",
      "REST API",
      "Ionic",
      "Capacitor",
      "Cordova",
      "Stencil.js",
      "JSON",
      "HTML/CSS/SCSS",
      "jQuery",
      "React",
      "Keycloak",
      "Web Components",
      "Jira/Confluence",
      "SCRUM",
      "MySQL",
      "Jenkins",
      "Android",
      "Ionic Trapeze",
      "iOS/Swift"
    ],
    "date": "JANUARY 2016, PRESENT"
  }
]
